<?php

$error_list = array(
    '0' => 'ok',
    /**
     * 系统出错
     */
    '100' => 'php 错误',
    '101' => 'mysql 错误',
    '102' => '错误错误', 
    /*
     * user信息错误为1xxx错误
     * business，deals等信息错误为2xxx错误
     * plan线路生成以及信息错误为3xxx错误
     * 其他错误为4xxx错误
     */
    '1003'=> '邮箱格式错误',
    '1004'=> '密码格式错误',
    '1005'=> '密码长度不能少于6个字符',
    '1006'=> '该昵称已存在',
    '1007'=> '该邮箱已经注册过',
    '2001'=>"非法的商铺ID(参数必须为正整数例如1或者1,2,3)",
    '2002'=>"非法的商区ID(参数必须为正整数例如1或者1,2,3)",
    '2003'=>'非法的团购ID(参数必须为正整数例如1或者1,2,3)',
    '2004'=>'过长的区域ID参数(参数长度为1)',
    "2005"=>"数据库内地区字段为非法值，应用已崩溃",
    "2006"=>"数据库中，没有tags信息",
    "2007"=>"过长的团购ID参数(参数长度为1)",
    '2008'=>"商铺查询条件为非法的参数",
    '2009'=>"数据库中暂无对应商铺信息",
    '2010'=>"暂无所请求的信息",
    '2011'=>"非法的地区ID",
    '2012'=>'非法的商铺ID(参数必须为正整数例如1)',
    '2013'=>"商铺ID不能为空",
    '3001'=>"暂无相应路线",
    '4001'=>'无法预期的数据库查询错误',
    
);
return $error_list;
?>